In [1]:
import numpy as np
import pandas as pd

s1 = pd.Series([0,1], index=['a','b'])
display(s1)
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
display(s2)
s3 = pd.Series([5, 6], index=['f', 'g'])
display(s3)

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [2]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [5]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [6]:
pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [7]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
display(df1)
display(df2)

          a         b         c         d
0 -0.835905 -0.848953  1.472542 -0.388496
1 -1.321283 -1.533046  0.284770  0.136969
2 -1.388865  0.644002  1.306339  0.016006

          b         d         a
0  0.896391  1.275968 -0.340618
1  0.787314  1.090102  0.449049

In [8]:
pd.concat([df1,df2])

          a         b         c         d
0 -0.835905 -0.848953  1.472542 -0.388496
1 -1.321283 -1.533046  0.284770  0.136969
2 -1.388865  0.644002  1.306339  0.016006
0 -0.340618  0.896391       NaN  1.275968
1  0.449049  0.787314       NaN  1.090102

In [9]:
pd.concat([df1,df2],axis=1)

          a         b         c         d         b         d         a
0 -0.835905 -0.848953  1.472542 -0.388496  0.896391  1.275968 -0.340618
1 -1.321283 -1.533046  0.284770  0.136969  0.787314  1.090102  0.449049
2 -1.388865  0.644002  1.306339  0.016006       NaN       NaN       NaN

In [10]:
pd.concat([df1,df2],keys=['10-1','10-2'])

               a         b         c         d
10-1 0 -0.835905 -0.848953  1.472542 -0.388496
     1 -1.321283 -1.533046  0.284770  0.136969
     2 -1.388865  0.644002  1.306339  0.016006
10-2 0 -0.340618  0.896391       NaN  1.275968
     1  0.449049  0.787314       NaN  1.090102

In [11]:
pd.concat([df1,df2],ignore_index=True)

          a         b         c         d
0 -0.835905 -0.848953  1.472542 -0.388496
1 -1.321283 -1.533046  0.284770  0.136969
2 -1.388865  0.644002  1.306339  0.016006
3 -0.340618  0.896391       NaN  1.275968
4  0.449049  0.787314       NaN  1.090102

In [12]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
                   index=['a', 'b', 'c'],
                   columns=['one','two'])
display(df1)
df2 = pd.DataFrame(np.arange(4).reshape(2, 2),
                   index=['a', 'c'],
                   columns=['three','four'])
display(df2)

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      0     1
c      2     3

In [15]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'])

  level1     level2
     one two  three four
a      0   1    0.0  1.0
b      2   3    NaN  NaN
c      4   5    2.0  3.0